; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v1 ?v6)
             (pred_1 ?v5 ?v11)
             (pred_12 ?v1 ?v11)
             (pred_10 ?v8 ?v1 )
	     (pred_8 ?v1)
             (pred_6 ?v7)
             (pred_9 ?v5)
             (pred_4 ?v11)
             (pred_2 ?v1)
             (pred_7 ?v5)
             (pred_5 ?v1)
             (pred_11 ))



(:action op_4
:parameters (?v12 ?v2 ?v10 ?v4)
:precondition (and (pred_6 ?v12) (pred_6 ?v2) (pred_9 ?v10) (pred_4 ?v4)
          (pred_3 ?v12 ?v2) (pred_1 ?v10 ?v4)
                   (pred_12 ?v2 ?v4) (pred_8 ?v12) 
                   (pred_2 ?v2) (pred_7 ?v10))
:effect (and  (pred_5 ?v2) (not (pred_2 ?v2))))


(:action op_1
:parameters (?v12 ?v3)
:precondition (and (pred_6 ?v12) (pred_6 ?v3)
               (pred_8 ?v12) (pred_3 ?v12 ?v3) (pred_5 ?v3))
:effect (and (pred_8 ?v3) (not (pred_8 ?v12))))

(:action op_2
:parameters (?v12 ?v10)
:precondition (and (pred_6 ?v12) (pred_9 ?v10) 
                  (pred_8 ?v12) (pred_10 ?v10 ?v12) (pred_11 ))
:effect (and (pred_7 ?v10)
   (not (pred_10 ?v10 ?v12)) (not (pred_11 ))))


(:action op_5
:parameters (?v12 ?v13 ?v9)
:precondition (and (pred_6 ?v12) (pred_9 ?v13) (pred_9 ?v9)
                  (pred_8 ?v12) (pred_7 ?v9) (pred_10 ?v13 ?v12))
:effect (and (pred_7 ?v13) (pred_10 ?v9 ?v12)
        (not (pred_7 ?v9)) (not (pred_10 ?v13 ?v12))))

(:action op_3
:parameters (?v12 ?v10)
:precondition (and (pred_6 ?v12) (pred_9 ?v10) 
                  (pred_8 ?v12) (pred_7 ?v10))
:effect (and (pred_11 ) (pred_10 ?v10 ?v12) (not (pred_7 ?v10)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_30 obj_11 obj_02 obj_03 obj_06 obj_28 obj_22 obj_04 obj_25 obj_09 obj_13 obj_24 obj_16 obj_15 obj_12 obj_19 obj_21 obj_10 obj_23 obj_07 obj_29 obj_26 obj_17 obj_14
    obj_01 obj_27
    obj_08 obj_20 obj_18
    )

    (:init
       (pred_11)

       (pred_6 obj_05)
       (pred_6 obj_30)
       (pred_6 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_28)
       (pred_6 obj_22)
       (pred_6 obj_04)
       (pred_6 obj_25)
       (pred_6 obj_09)
       (pred_6 obj_13)
       (pred_6 obj_24)
       (pred_6 obj_16)
       (pred_6 obj_15)
       (pred_6 obj_12)
       (pred_6 obj_19)
       (pred_6 obj_21)
       (pred_6 obj_10)
       (pred_6 obj_23)
       (pred_6 obj_07)
       (pred_6 obj_29)
       (pred_6 obj_26)
       (pred_6 obj_17)
       (pred_6 obj_14)
       (pred_4 obj_01)
       (pred_4 obj_27)
       (pred_9 obj_08)
       (pred_9 obj_20)
       (pred_9 obj_18)

       (pred_3 obj_05 obj_06)
       (pred_3 obj_05 obj_30)
       (pred_3 obj_30 obj_28)
       (pred_3 obj_30 obj_11)
       (pred_3 obj_30 obj_05)
       (pred_3 obj_11 obj_22)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_30)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_02 obj_03)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_03 obj_25)
       (pred_3 obj_03 obj_02)
       (pred_3 obj_06 obj_09)
       (pred_3 obj_06 obj_28)
       (pred_3 obj_06 obj_05)
       (pred_3 obj_28 obj_13)
       (pred_3 obj_28 obj_22)
       (pred_3 obj_28 obj_30)
       (pred_3 obj_28 obj_06)
       (pred_3 obj_22 obj_24)
       (pred_3 obj_22 obj_04)
       (pred_3 obj_22 obj_11)
       (pred_3 obj_22 obj_28)
       (pred_3 obj_04 obj_16)
       (pred_3 obj_04 obj_25)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_04 obj_22)
       (pred_3 obj_25 obj_15)
       (pred_3 obj_25 obj_03)
       (pred_3 obj_25 obj_04)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_09 obj_13)
       (pred_3 obj_09 obj_06)
       (pred_3 obj_13 obj_19)
       (pred_3 obj_13 obj_24)
       (pred_3 obj_13 obj_28)
       (pred_3 obj_13 obj_09)
       (pred_3 obj_24 obj_21)
       (pred_3 obj_24 obj_16)
       (pred_3 obj_24 obj_22)
       (pred_3 obj_24 obj_13)
       (pred_3 obj_16 obj_10)
       (pred_3 obj_16 obj_15)
       (pred_3 obj_16 obj_04)
       (pred_3 obj_16 obj_24)
       (pred_3 obj_15 obj_23)
       (pred_3 obj_15 obj_25)
       (pred_3 obj_15 obj_16)
       (pred_3 obj_12 obj_07)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_19 obj_29)
       (pred_3 obj_19 obj_21)
       (pred_3 obj_19 obj_13)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_21 obj_26)
       (pred_3 obj_21 obj_10)
       (pred_3 obj_21 obj_24)
       (pred_3 obj_21 obj_19)
       (pred_3 obj_10 obj_17)
       (pred_3 obj_10 obj_23)
       (pred_3 obj_10 obj_16)
       (pred_3 obj_10 obj_21)
       (pred_3 obj_23 obj_14)
       (pred_3 obj_23 obj_15)
       (pred_3 obj_23 obj_10)
       (pred_3 obj_07 obj_29)
       (pred_3 obj_07 obj_12)
       (pred_3 obj_29 obj_26)
       (pred_3 obj_29 obj_19)
       (pred_3 obj_29 obj_07)
       (pred_3 obj_26 obj_17)
       (pred_3 obj_26 obj_21)
       (pred_3 obj_26 obj_29)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_17 obj_10)
       (pred_3 obj_17 obj_26)
       (pred_3 obj_14 obj_23)
       (pred_3 obj_14 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_04)
       (pred_2 obj_29)
       (pred_12  obj_06 obj_01)
       (pred_12  obj_04 obj_27)
       (pred_12  obj_29 obj_01)
       (pred_5 obj_05)
       (pred_5 obj_30)
       (pred_5 obj_11)
       (pred_5 obj_02)
       (pred_5 obj_03)
       (pred_5 obj_28)
       (pred_5 obj_22)
       (pred_5 obj_25)
       (pred_5 obj_09)
       (pred_5 obj_13)
       (pred_5 obj_24)
       (pred_5 obj_16)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_19)
       (pred_5 obj_21)
       (pred_5 obj_10)
       (pred_5 obj_23)
       (pred_5 obj_07)
       (pred_5 obj_26)
       (pred_5 obj_17)
       (pred_5 obj_14)

       (pred_1  obj_08 obj_01)
       (pred_1  obj_20 obj_27)
       (pred_1  obj_18 obj_01)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_20 obj_22)
       (pred_10 obj_18 obj_30)
       (pred_8 obj_26)
    )

    (:goal (and
       (pred_10 obj_08 obj_11)
    ))
(:constraints
  (always (not (pred_8 obj_13)))
)
)

; plan
1. (op_1 obj_26 obj_21)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_21)
   goals met: 0 of 1
2. (op_1 obj_21 obj_19)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_19)
   goals met: 0 of 1
3. (op_1 obj_19 obj_12)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_12)
   goals met: 0 of 1
4. (op_1 obj_12 obj_09)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_09)
   goals met: 0 of 1
5. (op_2 obj_09 obj_08)
   deleted: (pred_10 obj_08 obj_09) (pred_11)
   added: (pred_7 obj_08)
   goals met: 0 of 1
6. (op_4 obj_09 obj_06 obj_08 obj_01)
   deleted: (pred_2 obj_06)
   added: (pred_5 obj_06)
   goals met: 0 of 1
7. (op_1 obj_09 obj_06)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_06)
   goals met: 0 of 1
8. (op_1 obj_06 obj_05)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_05)
   goals met: 0 of 1
9. (op_1 obj_05 obj_30)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_30)
   goals met: 0 of 1
10. (op_1 obj_30 obj_11)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_11)
   goals met: 0 of 1
11. (op_3 obj_11 obj_08)
   deleted: (pred_7 obj_08)
   added: (pred_11) (pred_10 obj_08 obj_11)
   goals met: 1 of 1
